@timoguin Thanks for raising this! However, I'm unable to duplicate the problem.

Test config:
```terraform
resource "aws_sns_topic" "test" {
  name = "topic-with-hyphens"
}

data "aws_sns_topic" "test" {
  name = aws_sns_topic.test.name
}

resource "aws_sns_topic" "test-fifo" {
  name       = "topic-name.fifo"
  fifo_topic = true
}

data "aws_sns_topic" "test-fifo" {
  name = aws_sns_topic.test-fifo.name
}
```

The results:

```console
% terraform -version
Terraform v0.15.4
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v3.42.0
% terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_sns_topic.test will be read during apply
  # (config refers to values not yet known)
 <= data "aws_sns_topic" "test"  {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "topic-with-hyphens"
    }

  # data.aws_sns_topic.test-fifo will be read during apply
  # (config refers to values not yet known)
 <= data "aws_sns_topic" "test-fifo"  {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "topic-name.fifo"
    }

  # aws_sns_topic.test will be created
  + resource "aws_sns_topic" "test" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "topic-with-hyphens"
      + name_prefix                 = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # aws_sns_topic.test-fifo will be created
  + resource "aws_sns_topic" "test-fifo" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = true
      + id                          = (known after apply)
      + name                        = "topic-name.fifo"
      + name_prefix                 = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_sns_topic.test-fifo: Creating...
aws_sns_topic.test: Creating...
aws_sns_topic.test: Creation complete after 2s [id=arn:aws:sns:us-west-2:067819342479:topic-with-hyphens]
data.aws_sns_topic.test: Reading...
aws_sns_topic.test-fifo: Creation complete after 2s [id=arn:aws:sns:us-west-2:067819342479:topic-name.fifo]
data.aws_sns_topic.test-fifo: Reading...
data.aws_sns_topic.test: Read complete after 0s [id=arn:aws:sns:us-west-2:067819342479:topic-with-hyphens]
data.aws_sns_topic.test-fifo: Read complete after 0s [id=arn:aws:sns:us-west-2:067819342479:topic-name.fifo]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```